nation=[
  "汉族",
  "壮族",
  "满族",
  "回族",
  "苗族",
  "维吾尔族",
  "土家族",
  "彝族",
  "蒙古族",
  "藏族",
  "布依族",
  "侗族",
  "瑶族",
  "朝鲜族",
  "白族",
  "哈尼族",
  "哈萨克族",
  "黎族",
  "傣族",
  "畲族",
  "傈僳族",
  "仡佬族",
  "东乡族",
  "高山族",
  "拉祜族",
  "水族",
  "佤族",
  "纳西族",
  "羌族",
  "土族",
  "仫佬族",
  "锡伯族",
  "柯尔克孜族",
  "达斡尔族",
  "景颇族",
  "毛南族",
  "撒拉族",
  "布朗族",
  "塔吉克族",
  "阿昌族",
  "普米族",
  "鄂温克族",
  "怒族",
  "京族",
  "基诺族",
  "德昂族",
  "保安族",
  "俄罗斯族",
  "裕固族",
  "乌孜别克族",
  "门巴族",
  "鄂伦春族",
  "独龙族",
  "塔塔尔族",
  "赫哲族",
  "珞巴族"
];
maritalStatusOptions=[
  '已婚',
  '未婚',
  '离异',
  '丧偶'
];
bloodTypeOptions=[
  'A型',
  'B型',
  'O型',
  'AB型',
  '未知'
];
religionOptions=[
  '无',
  '伊斯兰教',
  '天主教',
  '基督教',
  '佛教',
  '道教',
];
nationOptions=[
  '汉族',
  '回族'
];
// 政治面貌
politicsOptions = [
  '中共党员',
  '中共预备党员',
  '共青团员',
  '民革党员',
  '民盟盟员',
  '民建会员',
  '民进会员',
  '农工党党员',
  '致公党党员',
  '九三学社社员',
  '台盟盟员',
  '无党派人士',
  '群众'
];
// 文化程度
cultureOptions = [
  '博士',
  '硕士',
  '本科',
  '大专',
  '中专',
  '中技',
  '技工学校',
  '高中',
  '初中',
  '小学',
  '半文盲',
  '文盲'
];
// 表名
visitFormName = ['人口管理_常住人口信息', '人口管理_暂住人口登记', '其它场所', '出租房屋_出租房屋治安消防管理检查记录', '特种行业_旅店业检查记录',
  '统计_重点人口走访', '涉爆单位_安全检查', '商业网点_检查登记', '企事业单位_安全检查记录', '特种行业_废品金属收购业检查记录'];
sexOptions=['男', '女',];
military=['现服兵役','未服兵役','退役'];

//传入需要过滤=>为空的字段   ,   传入formdate对象    ，传入总的vm对象

//常住人口
populationManager = ['所属边境派出所名称', '地址', '坐标', '户主', '民族', '性别', '出生日期', '政治面貌', '宗教信仰',
  '文化程度', '工作单位', '婚姻状况', '籍贯', '身份证号', '联系电话', '兵役情况', '经济收支情况', '家庭史情况', '主要社会关系', '领里关系情况',
  '围封禁牧情况','家庭成员违法经历','雇工情况','周边治安热点及其他情况','周边重点地段及重要场所','其他情况','贵重物品信息','填表时间'];

tempPopulation = ['姓名','性别','别名','民族','出生日期','宗教信仰','身份证号','户籍地址','政治面貌',
  '联系电话','文化程度','婚姻状况','职业','兵役情况','从事本职业年限','来本地日期','拟居住期限','暂住处所及类型(例：小区号楼**室（自购、租赁、单位等)',
  '暂住事由','现服务处所','现从事职业','离开时间','离开原因','去向','备注','登记时间'];

// 企事业单位
companyManager = ['所属边境派出所名称', '单位名称', '所属部门', '单位分类', '地址', '单位性质', '法定代表人', '职工人数(个)', '重点要害部位数(个)',
  '枪弹库/民爆库', '治保、消防组织负责人', '治保、消防组织人数(个)', '人防措施', '物防措施', '技防措施', '单位联系电话', '法定代表人联系电话', '填表时间', '保安人员数(个)']; 

// 商业网点
commercialPoint = ['所属边境派出所名称', '单位名称', '主管部门', '营业执照号', '经验范围', '是否重点单位', '消防等级', '安装视频监控', '是否签订责任治安责任保证书',
  '法人姓名', '法人性别', '法人民族', '法人出生日期', '法人籍贯', '法人政治面貌', '法人文化程度', '法人工作单位', '法人婚姻状况', '法人身份证号码', '法人联系电话',
  '负责人姓名', '负责人性别', '负责人民族', '负责人出生日期', '负责人籍贯', '负责人政治面貌', '负责人文化程度', '负责人工作单位', '负责人婚姻状况', '负责人身份证号码',
  '负责人联系电话', '房主姓名', '房主性别', '房主民族', '房主出生日期', '房主籍贯', '房主政治面貌', '房主文化程度', '房主工作单位', '房主婚姻状况', '房主身份证号码',
  '房主联系电话', '商业网点基本情况说明', '填表时间'];

// 打击处理人员
combatPerson = ['姓名', '性别', '曾用名/别名', '民族', '出生日期', '目前职业', '婚姻状况', '联系电话', '身份证号', '户籍地详址', '居住地详址',
  '案由(盗窃、强奸、赌博等)', '处理情况(罚款、行政拘留等)', '幅度(1年、15天、200元等)', '处理日期', '处理机关', '执行情况', '填表时间', '单位'];

// 精神病患者
psycgePerson = ['姓名', '性别', '民族', '身份证号', '病人类别(①曾经肇事肇祸②可能肇事肇祸③其他)', '现实状态(①在家居住②就学③羁押服刑④就业⑤下落不明⑥住院治疗⑦其他)',
  '现居住地详址', '现住地派出所', '户籍地详址', '户籍派出所', '法定监护人姓名', '法定监护人身份证号码', '法定监护人性别', '法定监护人与病人关系', '法定监护人住址',
  '有无能力履行监护义务(有/无)', '法定监护人服务住所', '法定监护人信息备注', '填表时间', '单位'];

// 退伍人员
veteranPerson = ['姓名', '性别', '民族', '出生年月', '文化程度', '是否党团员', '身份证号', '家庭住址', '户籍地', '入伍前在何出任何职', '何时批准入伍', '何地批准入伍',
'入伍后历任何职', '身份类别(军转干部、复原士官、伤残军人等)', '联系电话', '身体情况', '是否服预备役', '有何诉求', '填表时间', '单位'];

// 无固定职业者
unemployedPerson = ['姓名', '性别', '民族', '出生年月', '文化程度', '婚否', '身体情况', '政治面貌', '联系电话', '身份证号', '家庭住址', '毕业时间1',
'毕业院校1', '所学专业1', '毕业时间2', '毕业院校2', '所学专业2', '毕业时间3', '毕业院校3', '所学专业3', '工作开始时间1', '工作终止时间1', '在何单位1',
'做何工作1', '工作开始时间2', '工作终止时间2', '在何单位2', '做何工作2', '工作开始时间3', '工作终止时间3', '在何单位3', '做何工作3', '家庭经济状况', '填表时间', '单位'];

// 吸毒人员
drugPerson = ['姓名', '性别', '曾用名/别名', '民族', '出生日期', '目前职业', '血型', '宗教信仰', '身高', '吸毒状态', '婚姻状态', '联系电话', '身份证号',
  '户籍地详址', '居住地详址', '滥用毒品种类', '目前思想状况', '填表时间', '单位'];

// 邪教重点人员
cultPerson = ['姓名', '性别', '民族', '文化程度', '政治面貌', '目前职业', '身份证号', '户籍地', '现住址', '工作单位', '联系电话', '邪教名称',
  '参加时间', '目前生产生活情况', '目前思想状况', '填表时间', '单位'];

// 重点帮助群众
helpPerson = ['姓名', '性别', '民族', '政治面貌', '文化程度', '健康状况', '劳动技能', '联系电话', '身份证号', '现住址', '家庭主要经济来源和收入情况',
  '需重点帮助原因(城镇低保户、农牧区特困户，孤寡老人等)', '填表时间', '单位'];

// 重点上访人员
petitionPerson = ['姓名', '性别', '年龄(岁)', '民族', '身份证号', '户籍地', '现住址', '曾到何处上访', '是否上访老户', '上访次数(次)', '联系电话',
  '上访原因', '上访合理诉求', '上访不合理诉求', '填表时间', '单位'];

// 重点人口走访
visitPerson = ['走访对象名称', '走访对象类型', '走访时间', '工作文字记录', '走访民警名称', '监护人', '走访时长(分钟)', '填表时间', '走访对象身份证号'];

// 走访记录
visitRecording = ['表名', '填表地点经度', '填表地点纬度', '填表人', '填表时间', '表数据名称'];

cityList = [
    {
      name:'左旗',
    child:[{
      name:'温都尔勒图镇',
    },{
      name:'乌斯太镇',
    },{
      name:'巴润别立镇',
    },{
      name:'巴彦浩特镇',
    },{
      name:'嘉尔格勒赛汉镇',
    },{
      name:'吉兰泰镇',
    },{
      name:'宗别立镇',
    },{
      name:'敖伦布拉格镇',
    },{
      name:'腾格里额里斯镇',
    },{
      name:'乌力吉苏木',
    },{
      name:'银根苏木',
    }]
  },{
    name:'右旗',
    child:[{
      name:'巴丹吉林镇',
    },{
      name:'雅布赖镇',
    },{
      name:'阿拉腾敖包镇',
    },{
      name:'塔木素布拉格苏木',
    }]
  },{
    name:'额济纳旗',
    child:[{
      name:'达来呼布镇',
    },{
      name:'东风镇',
    },{
      name:'哈日布日格德音乌拉镇',
    },{
      name:'马鬃山苏木',
    },{
      name:'赛汉陶来苏木',
    },{
      name:'苏泊淖尔苏木',
    },{
      name:'温图髙勒苏木',
    }]
  }
];

//支队
optionsZhiDui = [
    {name:'阿拉善盟边境管理支队',id:'101'},
    {name:'阿拉善盟路政支队',id:'102',value: 925}
  ];


//模拟数据- 支队走访次数 ,构成：FakeData + 支队的id
optionsZhiDuiFakeData = {
  'FakeData101' : {
    CZrkArray : [411, 211, 511, 211, 711, 1111, 1111],
    SywdArray : [21, 33, 21, 20, 31, 81, 41],
    SydwArray : [61, 11, 111, 11, 115, 21, 11],
    TzhyArray : [11, 51, 111, 73, 73, 71, 11],
    CzfwArray : [41, 51, 19, 21, 33, 42, 71],
    TysjArray : [11, 15, 41, 21, 11, 11, 11],
  },
  'FakeData102' : {
    CZrkArray : [41, 21, 51, 21, 71, 111, 111],
    SywdArray : [21, 33, 21, 20, 31, 81, 41],
    SydwArray : [61, 11, 111, 11, 115, 21, 11],
    TzhyArray : [11, 51, 111, 73, 73, 71, 11],
    CzfwArray : [41, 51, 19, 21, 33, 42, 71],
    TysjArray : [11, 15, 41, 21, 11, 11, 11],
  },
},

//大队
optionsDaDui = {
      // id为101的支队选择后显示的大队
      //                                           里程        任务次数
      '101':[{name:'阿盟左旗边境管理大队',id:'201',value: 225,Times:807},
             {name:'阿盟右旗边境管理大队',id:'202',value: 225,Times:963},
             {name:'阿盟额旗边境管理大队',id:'203',value: 225,Times:807}],
      // id为102的支队选择后显示的大队
      '102':[{name:'路政支队第三大队',id:'211',value: 225,Times:307}],

      //模拟数据 大队走访次数
      'FakeData201' : {
        CZrkArray : [41, 21, 51, 21, 71, 111, 111],
        SywdArray : [21, 33, 21, 20, 31, 81, 41],
        SydwArray : [61, 11, 111, 11, 115, 21, 11],
        TzhyArray : [11, 51, 111, 73, 73, 71, 11],
        CzfwArray : [41, 51, 19, 21, 33, 42, 71],
        TysjArray : [11, 15, 41, 21, 11, 11, 11],
      },

      'FakeData202':{
        CZrkArray : [22, 21, 19, 23, 71, 11, 11],
        SywdArray : [21, 33, 21, 33, 31, 81, 41],
        SydwArray : [61, 11, 11, 11, 11, 62, 11],
        TzhyArray : [11, 81, 11, 73, 23, 13, 11],
        CzfwArray : [41, 22, 19, 21, 123, 42, 71],
        TysjArray : [11, 2, 13, 13, 12, 13,23 ],
      },

      'FakeData203':{
        CZrkArray : [22, 21, 19, 3, 11, 11, 11],
        SywdArray : [21, 33, 21, 20, 11, 1, 1],
        SydwArray : [1, 31, 11, 11, 15, 51, 11],
        TzhyArray : [1, 21, 11, 3, 23, 11, 11],
        CzfwArray : [81, 51, 19, 21, 13, 12, 71],
        TysjArray : [18, 35, 41, 41, 11, 95,6 ],
      }

};

//派出所
optionsPaiChuSuo ={
  '201':[
      {name:'乌力吉边境派出所',id:'301',value: 325,Times:507},
      {name:'马鬃山边境派出所',id:'302',value: 205,Times:107},
      {name:'纳林髙勒边境派出所',id:'303',value: 105,Times:207}],

  '202':[
      {name:'策克口岸边境派出所',id:'311',value: 225,Times:207},
      {name:'塔木素边境派出所',id:'312',value: 205,Times:107}],

  //模拟数据 派出所走访次数
  'FakeData301' : {
    CZrkArray : [21, 11, 51, 21, 71, 11, 11],
    SywdArray : [21, 31, 21, 20, 31, 51, 12],
    SydwArray : [61, 11, 11, 11, 15, 21, 11],
    TzhyArray : [11, 11, 11, 73, 73, 71, 11],
    CzfwArray : [1, 11, 19, 21, 33, 12, 1],
    TysjArray : [11, 15, 41, 21, 11, 11, 11],
  },

  'FakeData302':{
    CZrkArray : [31, 21, 51, 21, 1, 11, 11],
    SywdArray : [21, 33, 21, 20, 3, 8, 41],
    SydwArray : [61, 11, 111, 11, 15, 21, 11],
    TzhyArray : [11, 51, 11, 23, 73, 71, 11],
    CzfwArray : [41, 21, 19, 21, 133, 42, 1],
    TysjArray : [11, 35, 41, 23, 11, 12, 11],
  },
};

optionsPerson = {
  '301' : [{name:'边星平',id:'401',value: 9827,Times:20},{name:'布日格德',id:'402',value: 15201,Times:5},{name:'陈曦煜',id:'403',value: 20225,Times:13}],
  '302' : [{name:'巴依尔',id:'411'},{name:'付兴赛',id:'412'},{name:'李海峰',id:'413'}],
  '303' : [{name:'陈杰',id:'411'},{name:'陈亚伟',id:'412'},{name:'丁海贸',id:'413'}],


  '311' : [{name:'包亚翰',id:'421'},{name:'刘举鹏',id:'402'},{name:'尚志军',id:'403'}],
  '312' : [{name:'包建伟',id:'431'},{name:'王鹏飞',id:'402'},{name:'扎雅泰',id:'403'}],

  //模拟数据 人员走访次数
  'FakeData401' : {
    CZrkArray : [1, 2, 3, 4, 5, 2, 1],
    SywdArray : [21, 33, 21, 20, 31, 8, 23],
    SydwArray : [6, 11, 11, 11, 5, 21, 1],
    TzhyArray : [11, 51, 11, 7, 3, 11, 1],
    CzfwArray : [21, 5, 19, 21, 33, 22, 1],
    TysjArray : [11, 15, 41, 21, 11, 31, 2],
  },

  'FakeData402':{
    CZrkArray : [1, 1, 4, 3, 2, 2, 3],
    SywdArray : [3, 2, 3, 1, 2, 3, 3],
    SydwArray : [1, 1, 11, 1, 5, 2, 1],
    TzhyArray : [1, 5, 1, 3, 7, 7, 1],
    CzfwArray : [1, 1, 1, 2, 3, 4, 7],
    TysjArray : [1, 1, 10, 1, 1, 1, 1],
  },


} ;

